IDEA StatiCa Open Model
TypeCalculationCombiSIA Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of combination
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum TypeCalculationCombiSIA
Public Enumeration TypeCalculationCombiSIA
public enum class TypeCalculationCombiSIA
Members
Member name | Value | Description
Linear | 0 |  Linear combination
Envelope | 1 |  Envelope combination
Code | 2 |  Combination according to code
See Also
Reference
IdeaRS.OpenModel.Loading Namespace